ArminJo/ATtinySerialOut/src/ATtinySerialOut.hpp
/*
 * ATtinySerialOut.hpp
 *
 * For transmitting debug data over bit bang serial with 115200 baud for 1/8/16 MHz ATtiny clock.
 * For 1 MHz you can choose also 38400 baud (120 bytes smaller code size).
 * For 8/16 MHz you can choose also 230400 baud (just faster).
 * 1 Start, 8 Data, 1 Stop, No Parity
 *
 * Using PB2 // (Pin7 on Tiny85) as default TX pin to be compatible with digispark board
 * To change the output pin, add a line "#define TX_PIN ..." before the line #include "TinySerialOut.hpp"
 * or or set it as compiler symbol like "-DTX_PIN PIN_PB1".
 *
 * Using the Serial.print commands needs 4 bytes extra for each call.
 *
 *
 *  Copyright (C) 2015-2024  Armin Joachimsmeyer
 *  Email: armin.joachimsmeyer@gmail.com
 *
 *  This file is part of TinySerialOut https://github.com/ArminJo/ATtinySerialOut.
 *
 *  TinySerialOut is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 *  See the GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with this program. If not, see <http://www.gnu.org/licenses/gpl.html>.
 *
 */

#ifndef _ATTINY_SERIAL_OUT_HPP
#define _ATTINY_SERIAL_OUT_HPP

#if defined(__AVR_ATtiny25__) || defined(__AVR_ATtiny45__) || defined(__AVR_ATtiny85__) \
    || defined(__AVR_ATtiny24__) || defined(__AVR_ATtiny44__) || defined(__AVR_ATtiny84__) \
    || defined(__AVR_ATtiny87__) || defined(__AVR_ATtiny167__) \
    || defined(__AVR_ATtiny88__)
#include "ATtinySerialOut.h"
#include <avr/eeprom.h>     // for eeprom_read_byte() in writeString_E()

#ifndef _NOP
#define _NOP()  __asm__ volatile ("nop")
#endif

#if !defined(PORTB)
#define PORTB (*(volatile uint8_t *)((0x18) + 0x20))
#endif

#if defined(__AVR_ATtiny87__) || defined(__AVR_ATtiny167__) // For use with ATTinyCore
#  if TX_PIN == PIN_PA0 || TX_PIN == PIN_PA1 || TX_PIN == PIN_PA2 || TX_PIN == PIN_PA3 \
    || TX_PIN == PIN_PA4 || TX_PIN == PIN_PA5 || TX_PIN == PIN_PA6 || TX_PIN == PIN_PA7
#define TX_PORT         PORTA
#define TX_PORT_ADDR    0x02 // from #define PORTA _SFR_IO8(0x02)
#define TX_DDR          DDRA
#  else
#define TX_PORT         PORTB
#define TX_PORT_ADDR    0x05 // from #define PORTB _SFR_IO8(0x05)
#define TX_DDR          DDRB
#  endif

#elif defined(__AVR_ATtiny88__)
//  MH-ET LIVE Tiny88(16.0MHz) board
#  if TX_PIN <= 7
#define TX_PORT         PORTD
#define TX_PORT_ADDR    0x0B // from #define PORTD _SFR_IO8(0x0B)
#define TX_DDR          DDRD
#  elif TX_PIN <= 15
#define TX_PORT         PORTB
#define TX_PORT_ADDR    0x05
#define TX_DDR          DDRB
#  elif TX_PIN <= 22
#define TX_PORT         PORTC
#define TX_PORT_ADDR    0x08
#define TX_DDR          DDRC
#  elif TX_PIN <= 26
#define TX_PORT         PORTA
#define TX_PORT_ADDR    0x0E
#define TX_DDR          DDRA
#  else
#define TX_PORT         PORTC
#define TX_PORT_ADDR    0x08
#define TX_DDR          DDRC
#  endif

#elif defined(__AVR_ATtiny84__) // For use with ATTinyCore
#  if TX_PIN == PIN_PA0 || TX_PIN == PIN_PA1 || TX_PIN == PIN_PA2 || TX_PIN == PIN_PA3 \
    || TX_PIN == PIN_PA4 || TX_PIN == PIN_PA5 || TX_PIN == PIN_PA6 || TX_PIN == PIN_PA7
#define TX_PORT         PORTA
#define TX_PORT_ADDR    0x1B
#define TX_DDR          DDRA
#  else
#define TX_PORT         PORTB
#define TX_PORT_ADDR    0x18
#define TX_DDR          DDRB
#  endif

#else
//  ATtinyX5 here
#define TX_PORT         PORTB
#define TX_PORT_ADDR    0x18 // PORTB
#define TX_DDR          DDRB
#endif // defined(__AVR_ATtiny87__) || defined(__AVR_ATtiny167__)

#if defined(digitalPinToPCMSKbit)
#define TX_BIT_NUMBER   digitalPinToPCMSKbit(TX_PIN)
#else
#define TX_BIT_NUMBER   TX_PIN
#endif

void write1Start8Data1StopNoParity(uint8_t aValue);

bool sUseCliSeiForWrite = true;

/*
 * The Serial Instance!!!
 */
// #if ... to be compatible with ATTinyCores and AttinyDigisparkCores
#if (!defined(UBRRH) && !defined(UBRR0H)) /*AttinyDigisparkCore and AttinyDigisparkCore condition*/ \
    || USE_SOFTWARE_SERIAL /*AttinyDigisparkCore condition*/\
    || ((defined(UBRRH) || defined(UBRR0H) || defined(UBRR1H) || defined(LINBRRH)) && !USE_SOFTWARE_SERIAL)/*AttinyDigisparkCore condition for HardwareSerial*/
// Switch to SerialOut since Serial is already defined
// or activate line 745 in TinyDebugSerial.h included in AttinyDigisparkCores/src/tiny/WProgram.h at line 24 for AttinyDigisparkCores
TinySerialOut SerialOut;
#else
TinySerialOut Serial;
#endif

/*
 * Must be called once if pin is not set to output otherwise
 */
void initTXPin() {
    // TX_PIN is active LOW, so set it to HIGH initially
    TX_PORT |= (1 << TX_BIT_NUMBER);
    // set pin direction to output
    TX_DDR |= (1 << TX_BIT_NUMBER);
}

void write1Start8Data1StopNoParityWithCliSei(uint8_t aValue) {
    uint8_t oldSREG = SREG;
    cli();
    write1Start8Data1StopNoParity(aValue);
    SREG = oldSREG;
}

void writeValue(uint8_t aValue) {
    write1Start8Data1StopNoParity(aValue);
}

/*
 * Used for writeString() and therefore all write<type>() and print<type>
 */
void useCliSeiForStrings(bool aUseCliSeiForWrite) {
    sUseCliSeiForWrite = aUseCliSeiForWrite;
}

/*
 * Write String residing in RAM
 */
void writeString(const char *aStringPtr) {
#if !defined(USE_ALWAYS_CLI_SEI_GUARD_FOR_OUTPUT)
    if (sUseCliSeiForWrite) {
#endif
        while (*aStringPtr != 0) {
            write1Start8Data1StopNoParityWithCliSei(*aStringPtr++);
        }
#if !defined(USE_ALWAYS_CLI_SEI_GUARD_FOR_OUTPUT)
    } else {
        while (*aStringPtr != 0) {
            write1Start8Data1StopNoParity(*aStringPtr++);
        }
    }
#endif
}

/*
 * Write string residing in program memory (FLASH)
 */
void writeString_P(const char *aStringPtr) {
    uint8_t tChar = pgm_read_byte((const uint8_t* ) aStringPtr);
// Comparing with 0xFF is safety net for wrong string pointer
    while (tChar != 0 && tChar != 0xFF) {
#if defined(USE_ALWAYS_CLI_SEI_GUARD_FOR_OUTPUT)
        write1Start8Data1StopNoParityWithCliSei(tChar);
#else
        if (sUseCliSeiForWrite) {
            write1Start8Data1StopNoParityWithCliSei(tChar);
        } else {
            write1Start8Data1StopNoParity(tChar);
        }
#endif
        tChar = pgm_read_byte((const uint8_t* ) ++aStringPtr);
    }
}

