ArminJo/ATtinySerialOut/src/ATtinySerialOut.hpp
/*
 * Write string residing in program memory (FLASH)
 */
void writeString(const __FlashStringHelper *aStringPtr) {
    PGM_P tPGMStringPtr = reinterpret_cast<PGM_P>(aStringPtr);
    uint8_t tChar = pgm_read_byte((const uint8_t* ) aStringPtr);
// Comparing with 0xFF is safety net for wrong string pointer
    while (tChar != 0 && tChar != 0xFF) {
#if defined(USE_ALWAYS_CLI_SEI_GUARD_FOR_OUTPUT)
        write1Start8Data1StopNoParityWithCliSei(tChar);
#else
        if (sUseCliSeiForWrite) {
            write1Start8Data1StopNoParityWithCliSei(tChar);
        } else {
            write1Start8Data1StopNoParity(tChar);
        }
#endif
        tChar = pgm_read_byte((const uint8_t* ) ++tPGMStringPtr);
    }
}

/*
 * Write string residing in EEPROM space
 */
void writeString_E(const char *aStringPtr) {
    uint8_t tChar = eeprom_read_byte((const uint8_t*) aStringPtr);
    // Comparing with 0xFF is safety net for wrong string pointer
    while (tChar != 0 && tChar != 0xFF) {
#if defined(USE_ALWAYS_CLI_SEI_GUARD_FOR_OUTPUT)
        write1Start8Data1StopNoParityWithCliSei(tChar);
#else
        if (sUseCliSeiForWrite) {
            write1Start8Data1StopNoParityWithCliSei(tChar);
        } else {
            write1Start8Data1StopNoParity(tChar);
        }
#endif
        tChar = eeprom_read_byte((const uint8_t*) ++aStringPtr);
    }
}

void writeStringWithoutCliSei(const char *aStringPtr) {
    while (*aStringPtr != 0) {
        write1Start8Data1StopNoParity(*aStringPtr++);
    }
}

void writeStringWithCliSei(const char *aStringPtr) {
    while (*aStringPtr != 0) {
        write1Start8Data1StopNoParityWithCliSei(*aStringPtr++);
    }
}

void writeStringSkipLeadingSpaces(const char *aStringPtr) {
    // skip leading spaces
    while (*aStringPtr == ' ' && *aStringPtr != 0) {
        aStringPtr++;
    }
#if !defined(USE_ALWAYS_CLI_SEI_GUARD_FOR_OUTPUT)
    if (sUseCliSeiForWrite) {
#endif
        while (*aStringPtr != 0) {
            write1Start8Data1StopNoParityWithCliSei(*aStringPtr++);
        }
#if !defined(USE_ALWAYS_CLI_SEI_GUARD_FOR_OUTPUT)
    } else {
        while (*aStringPtr != 0) {
            write1Start8Data1StopNoParity(*aStringPtr++);
        }
    }
#endif
}

void writeBinary(uint8_t aByte) {
#if defined(USE_ALWAYS_CLI_SEI_GUARD_FOR_OUTPUT)
    write1Start8Data1StopNoParityWithCliSei(aByte);
#else
    if (sUseCliSeiForWrite) {
        write1Start8Data1StopNoParityWithCliSei(aByte);
    } else {
        write1Start8Data1StopNoParity(aByte);
    }
#endif
}

void writeChar(uint8_t aChar) {
    writeBinary(aChar);
}

void writeCRLF() {
    writeBinary('\r');
    writeBinary('\n');
}

void writeUnsignedByte(uint8_t aByte) {
    char tStringBuffer[4];
    utoa(aByte, tStringBuffer, 10);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

/*
 * 2 byte Hex output
 */
void writeUnsignedByteHex(uint8_t aByte) {
    char tStringBuffer[3];
    //    tStringBuffer[0] = nibbleToHex(aByte >> 4);
    //    tStringBuffer[1] = nibbleToHex(aByte);
    //    tStringBuffer[2] = '\0';
    // the utoa() version is 8 bytes smaller than the version with nibbleToHex(), if utoa() is allocated by another function.
    utoa(aByte, &tStringBuffer[0], 16);
    if (tStringBuffer[1] == '\0') {
        tStringBuffer[2] = '\0';
        tStringBuffer[1] = tStringBuffer[0];
        tStringBuffer[0] = '0';
    }
    writeString(tStringBuffer);
}

/*
 * 2 byte Hex output with 2 byte prefix "0x"
 */
void writeUnsignedByteHexWithPrefix(uint8_t aByte) {
    writeBinary('0');
    writeBinary('x');
    writeUnsignedByteHex(aByte);
}

char nibbleToHex(uint8_t aByte) {
    aByte = aByte & 0x0F;
    if (aByte < 10) {
        return aByte + '0';
    }
    return aByte + 'A' - 10;
}

void writeByte(int8_t aByte) {
    char tStringBuffer[5];
    itoa(aByte, tStringBuffer, 10);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void writeInt(int16_t aInteger) {
    char tStringBuffer[7];
    itoa(aInteger, tStringBuffer, 10);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void writeUnsignedInt(uint16_t aInteger) {
    char tStringBuffer[6];
    utoa(aInteger, tStringBuffer, 10);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void writeLong(int32_t aLong) {
    char tStringBuffer[12];
    ltoa(aLong, tStringBuffer, 10);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void writeUnsignedLong(uint32_t aLong) {
    char tStringBuffer[11];
    ultoa(aLong, tStringBuffer, 10);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void writeFloat(double aFloat) {
    char tStringBuffer[11];
    dtostrf(aFloat, 10, 3, tStringBuffer);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void writeFloat(double aFloat, uint8_t aDigits) {
    char tStringBuffer[11];
    dtostrf(aFloat, 10, aDigits, tStringBuffer);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

/******************************************************
 * The TinySerialOut class functions which implements
 * the Serial + printHex() and printlnHex() functions
 ******************************************************/
/*
 * An alternative way to call the init function :-)
 */
void TinySerialOut::begin(long aBaudrate) {
    initTXPin();
#if defined(_USE_115200BAUD) // else smaller code, but only 38400 baud at 1 MHz
    if (aBaudrate != 115200) {
        println(F("Only 115200 supported!"));
    }
#else
#if (F_CPU == 1000000)
    if (aBaudrate != 38400) {
        println(F("Only 38400 supported!"));
    }
#else
    if (aBaudrate != 230400) {
        println(F("Only 230400 supported!"));
    }
#endif
#endif
}

void TinySerialOut::end() {
    // no action needed
}

void TinySerialOut::flush() {
    // no action needed, since we do not use a buffer
}

/*
 * 2 byte Hex output with 2 byte prefix "0x"
 */
void TinySerialOut::printHex(uint8_t aByte) {
    writeUnsignedByteHexWithPrefix(aByte);
}

void TinySerialOut::printHex(uint16_t aWord) {
    writeUnsignedByteHexWithPrefix(aWord >> 8);
    writeUnsignedByteHex(aWord);
}

void TinySerialOut::printlnHex(uint8_t aByte) {
    printHex(aByte);
    println();
}

void TinySerialOut::printlnHex(uint16_t aWord) {
    printHex(aWord);
    println();
}

// virtual functions of Print class
size_t TinySerialOut::write(uint8_t aByte) {
    writeBinary(aByte);
    return 1;
}
#if !defined(TINY_SERIAL_INHERIT_FROM_PRINT)

void TinySerialOut::print(const char *aStringPtr) {
    writeString(aStringPtr);
}

void TinySerialOut::print(const __FlashStringHelper *aStringPtr) {
    writeString(aStringPtr);
}

void TinySerialOut::print(char aChar) {
    writeBinary(aChar);
}

