ArminJo/ATtinySerialOut/src/ATtinySerialOut.hpp
void TinySerialOut::print(uint8_t aByte, uint8_t aBase) {
    if (aBase == 16) {
        /*
         * Print Hex always with two characters
         */
        writeUnsignedByteHex(aByte);
    } else {
        char tStringBuffer[4];
        utoa(aByte, tStringBuffer, aBase);
        writeStringSkipLeadingSpaces(tStringBuffer);
    }
}

void TinySerialOut::print(int16_t aInteger, uint8_t aBase) {
    char tStringBuffer[7];
    itoa(aInteger, tStringBuffer, aBase);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void TinySerialOut::print(uint16_t aInteger, uint8_t aBase) {
    char tStringBuffer[6];
    utoa(aInteger, tStringBuffer, aBase);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void TinySerialOut::print(int32_t aLong, uint8_t aBase) {
    char tStringBuffer[12];
    ltoa(aLong, tStringBuffer, aBase);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void TinySerialOut::print(uint32_t aLong, uint8_t aBase) {
    char tStringBuffer[11];
    ultoa(aLong, tStringBuffer, aBase);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void TinySerialOut::print(double aFloat, uint8_t aDigits) {
    char tStringBuffer[11];
    dtostrf(aFloat, 10, aDigits, tStringBuffer);
    writeStringSkipLeadingSpaces(tStringBuffer);
}

void TinySerialOut::println(char aChar) {
    print(aChar);
    println();
}

void TinySerialOut::println(const char *aStringPtr) {
    print(aStringPtr);
    println();
}

void TinySerialOut::println(const __FlashStringHelper *aStringPtr) {
    print(aStringPtr);
    println();
}

void TinySerialOut::println(uint8_t aByte, uint8_t aBase) {
    print(aByte, aBase);
    println();
}

void TinySerialOut::println(int16_t aInteger, uint8_t aBase) {
    print(aInteger, aBase);
    println();
}

void TinySerialOut::println(uint16_t aInteger, uint8_t aBase) {
    print(aInteger, aBase);
    println();
}

void TinySerialOut::println(int32_t aLong, uint8_t aBase) {
    print(aLong, aBase);
    println();
}

void TinySerialOut::println(uint32_t aLong, uint8_t aBase) {
    print(aLong, aBase);
    println();
}

void TinySerialOut::println(double aFloat, uint8_t aDigits) {
    print(aFloat, aDigits);
    println();
}

void TinySerialOut::println() {
    print('\r');
    print('\n');
}
#endif // !defined(TINY_SERIAL_INHERIT_FROM_PRINT)

/********************************
 * Basic serial output function
 *******************************/

/*
 * Formula is only valid for constant values
 * Loading of constant value adds 2 extra cycles (check .lss file for exact timing)
 *
 * The loop takes 4 cycles (4 microseconds  at 1 MHz). Last loop is only 3 cycles.
 * 1 -> 3(+2) cycles
 * 2 -> 7(+2) cycles
 * 3 -> 11(+2) cycles
 * 4 -> 15(+2) cycles
 * 5 -> 19(+2) cycles
 * 6 -> 23(+2) cycles
 */
inline void delay4CyclesExact(uint16_t a4Microseconds) {
    asm volatile (
            "1: sbiw %0,1" "\n\t" // 2 cycles
            "brne .-4" : "=w" (a4Microseconds) : "0" (a4Microseconds)// 2 cycles
    );
}

#if (F_CPU == 1000000) && defined(_USE_115200BAUD) // else smaller code, but only 38400 baud at 1 MHz
/*
 * 115200 baud - 8,680 cycles per bit, 86,8 per byte at 1 MHz
 *
 *  Assembler code for 115200 baud extracted from Digispark core files:
 *  Code size is 196 byte (including first call)
 *
 *   TinySerialOut.h - Tiny write-only software serial.
 *   Copyright 2010 Rowdy Dog Software. This code is part of Arduino-Tiny.
 *
 *   Arduino-Tiny is free software: you can redistribute it and/or modify it
 *   under the terms of the GNU Lesser General Public License as published by
 *   the Free Software Foundation, either version 3 of the License, or (at your
 *   option) any later version.
 */
void write1Start8Data1StopNoParity(uint8_t aValue) {
    asm volatile
    (
            "cbi   %[txport], %[txpin]" "\n\t" /* 2  <--- 0 */
            "ror   %[value]" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */

            "brcs  L%=b0h" "\n\t" /* 1  (not taken) */
            "nop" "\n\t" /* 1 */
            "cbi   %[txport], %[txpin]" "\n\t" /* 2  <--- st is 9 cycles */
            "rjmp  L%=b0z" "\n\t" /* 2 */
            "L%=b0h: " /* 2  (taken) */
            "sbi   %[txport], %[txpin]" "\n\t" /* 2  <--- st is 9 cycles */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "L%=b0z: "
            "ror   %[value]" "\n\t" /* 1 */

            "nop" "\n\t" /* 1 */

            "brcs  L%=b1h" "\n\t" /* 1  (not taken) */
            "nop" "\n\t" /* 1 */
            "cbi   %[txport], %[txpin]" "\n\t" /* 2  <--- b0 is 8 cycles */
            "rjmp  L%=b1z" "\n\t" /* 2 */
            "L%=b1h: " /* 2  (taken) */
            "sbi   %[txport], %[txpin]" "\n\t" /* 2  <--- b0 is 8 cycles */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "L%=b1z: "
            "ror   %[value]" "\n\t" /* 1 */

            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */

            "brcs  L%=b2h" "\n\t" /* 1  (not taken) */
            "nop" "\n\t" /* 1 */
            "cbi   %[txport], %[txpin]" "\n\t" /* 2  <--- b1 is 9 cycles */
            "rjmp  L%=b2z" "\n\t" /* 2 */
            "L%=b2h: " /* 2  (taken) */
            "sbi   %[txport], %[txpin]" "\n\t" /* 2  <--- b1 is 9 cycles */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "L%=b2z: "
            "ror   %[value]" "\n\t" /* 1 */

            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */

            "brcs  L%=b3h" "\n\t" /* 1  (not taken) */
            "nop" "\n\t" /* 1 */
            "cbi   %[txport], %[txpin]" "\n\t" /* 2  <--- b2 is 9 cycles */
            "rjmp  L%=b3z" "\n\t" /* 2 */
            "L%=b3h: " /* 2  (taken) */
            "sbi   %[txport], %[txpin]" "\n\t" /* 2  <--- b2 is 9 cycles */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "L%=b3z: "
            "ror   %[value]" "\n\t" /* 1 */

            "nop" "\n\t" /* 1 */

            "brcs  L%=b4h" "\n\t" /* 1  (not taken) */
            "nop" "\n\t" /* 1 */
            "cbi   %[txport], %[txpin]" "\n\t" /* 2  <--- b3 is 8 cycles */
            "rjmp  L%=b4z" "\n\t" /* 2 */
            "L%=b4h: " /* 2  (taken) */
            "sbi   %[txport], %[txpin]" "\n\t" /* 2  <--- b3 is 8 cycles */
            "nop" "\n\t" /* 1 */
            "nop" "\n\t" /* 1 */
            "L%=b4z: "
            "ror   %[value]" "\n\t" /* 1 */

