ArminJo/ATtinySerialOut/src/ATtinySerialOut.hpp
}
#endif

/*
 * C Version which generates the assembler code above.
 *      In order to guarantee the correct timing, compile with Arduino standard settings or:
 *      avr-g++ -I"C:\arduino\hardware\arduino\avr\cores\arduino" -I"C:\arduino\hardware\arduino\avr\variants\standard" -c -g -w -Os -ffunction-sections -fdata-sections -mmcu=attiny85 -DF_CPU=1000000UL -MMD -o "TinySerialOut.o" "TinySerialOut.cpp"
 *      Tested with Arduino 1.6.8 and 1.8.5/gcc4.9.2
 *      C Version does not work with AVR gcc7.3.0, since optimization is too bad
 */
void write1Start8Data1StopNoParity_C_Version(uint8_t aValue) {
    /*
     * C Version here for 38400 baud at 1 MHz Clock. You see, it is simple :-)
     */
// start bit
    TX_PORT &= ~(1 << TX_BIT_NUMBER);
    _NOP();
    delay4CyclesExact(4);

// 8 data bits
    uint8_t i = 8;
    do {
        if (aValue & 0x01) {
            // bit=1
            // to compensate for jump at data=0
            _NOP();
            TX_PORT |= 1 << TX_BIT_NUMBER;
        } else {
            // bit=0
            TX_PORT &= ~(1 << TX_BIT_NUMBER);
            // compensate for different cycles of sbrs
            _NOP();
            _NOP();
        }
        aValue = aValue >> 1;
        // 3 cycles padding
        _NOP();
        _NOP();
        _NOP();
        delay4CyclesExact(3);
        --i;
    } while (i > 0);

// to compensate for missing loop cycles at last bit
    _NOP();
    _NOP();
    _NOP();
    _NOP();

// Stop bit
    TX_PORT |= 1 << TX_BIT_NUMBER;
// -8 cycles to compensate for fastest repeated call (1 ret + 1 load + 1 call)
    delay4CyclesExact(4); // gives minimum 25 cycles for stop bit :-)
}
#elif defined(ARDUINO_ARCH_APOLLO3)
    void AttinySerialOutDummyToAvoidBFDAssertions(){
        ;
    }
#endif // defined(__AVR_ATtiny25__) || defined(__AVR_ATtiny45__) || defined(__AVR_ATtiny85__) || defined(__AVR_ATtiny87__) || defined(__AVR_ATtiny167__)

#endif // _ATTINY_SERIAL_OUT_HPP
